# TooLargeSketch Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..PerformanceFailures..::..TooLargeSketch Property
BuiltInFailures..::..PerformanceFailures Class See Also
---
Sketch of <element> has large area - it may slow down selection, drawing and geometric computations.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId TooLargeSketch { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property TooLargeSketch As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ TooLargeSketch {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..PerformanceFailures Class
Autodesk.Revit.DB Namespace